In [1]:
# continuation of lec 2
import pandas as pd
data = pd.read_csv("credit_card_transactions.csv")
print(data.head())

   Transaction_ID  Customer_ID Transaction_Date Transaction_Type Merchant  \
0          100000         4452       2023-01-01           Online  Walmart
1          100001         2775       2023-01-01              ATM  BestBuy
2          100002         2259       2023-01-01   Mobile Payment     Uber
3          100003         4545       2023-01-01           Online  BestBuy
4          100004         2137       2023-01-01              ATM   Amazon

   Category   Amount Payment_Mode Transaction_Status       Location
0    Travel  4520.70   Debit Card           Approved      Jonesport
1    Travel  1437.85   Debit Card           Approved  Port Jennifer
2  Clothing  3320.52       PayPal           Approved     Port James
3    Travel  2659.96   Debit Card           Approved     Hawkinston
4    Travel  2517.07   Debit Card           Approved    Matthewland

In [3]:
# export new_record to csv 
new_record = data[(data['Amount'] > 4000) & (data['Transaction_Type'] == 'Online')]
new_record.to_csv('new_record.csv',index = False)

In [4]:
#adding and modifying data 
import pandas as pd
data = {
    'Name':['Rahul','Rohan','Tiya','Riya','Diana','Joy','Nishant','Heena','Deep'],
    'Age' :[23,34,45,67,24,12,50,22,56],
    'City':['Tokyo','Paris','Mumbai','Surat','Bhuj','Jaipur','Pune','Pune','Mumbai']
}
df = pd.DataFrame(data)
print(df)

      Name  Age    City
0    Rahul   23   Tokyo
1    Rohan   34   Paris
2     Tiya   45  Mumbai
3     Riya   67   Surat
4    Diana   24    Bhuj
5      Joy   12  Jaipur
6  Nishant   50    Pune
7    Heena   22    Pune
8     Deep   56  Mumbai

In [5]:
# add new column
df['Salary'] = [5000,6000,7000,9000,6000,8000,4440,6398,1545]
print(df)

      Name  Age    City  Salary
0    Rahul   23   Tokyo    5000
1    Rohan   34   Paris    6000
2     Tiya   45  Mumbai    7000
3     Riya   67   Surat    9000
4    Diana   24    Bhuj    6000
5      Joy   12  Jaipur    8000
6  Nishant   50    Pune    4440
7    Heena   22    Pune    6398
8     Deep   56  Mumbai    1545

In [12]:
#modifying existing column
df['Age'] = df['Age'] +2
print(df)

      Name  Age    City  Salary
0    Rahul   27   Tokyo    5000
1    Rohan   38   Paris    6000
2     Tiya   49  Mumbai    7000
3     Riya   71   Surat    9000
4    Diana   28    Bhuj    6000
5      Joy   16  Jaipur    8000
6  Nishant   54    Pune    4440
7    Heena   26    Pune    6398
8     Deep   60  Mumbai    1545
9   malhar   23   Tokyo    5000

In [11]:
# add new row
new_row = {'Name':'malhar','Age':21,'City':'Tokyo','Salary':5000}
#concat new row to the dataframe
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
print(df)

      Name  Age    City  Salary
0    Rahul   25   Tokyo    5000
1    Rohan   36   Paris    6000
2     Tiya   47  Mumbai    7000
3     Riya   69   Surat    9000
4    Diana   26    Bhuj    6000
5      Joy   14  Jaipur    8000
6  Nishant   52    Pune    4440
7    Heena   24    Pune    6398
8     Deep   58  Mumbai    1545
9   malhar   21   Tokyo    5000

In [13]:
# another way
new_row = {'Name':'malhar','Age':21,'City':'Tokyo','Salary':5000}
row = pd.DataFrame([new_row])
#concat new row to the dataframe
df = pd.concat([df, row], ignore_index=True)
print(df)

       Name  Age    City  Salary
0     Rahul   27   Tokyo    5000
1     Rohan   38   Paris    6000
2      Tiya   49  Mumbai    7000
3      Riya   71   Surat    9000
4     Diana   28    Bhuj    6000
5       Joy   16  Jaipur    8000
6   Nishant   54    Pune    4440
7     Heena   26    Pune    6398
8      Deep   60  Mumbai    1545
9    malhar   23   Tokyo    5000
10   malhar   21   Tokyo    5000

In [16]:
# adding none value
#import numpi to add none in numbers value like age salary
import numpy as np
new_row = {'Name':None,'Age': np.nan,'City':'Tokyo','Salary':5000}
row = pd.DataFrame([new_row])
#concat new row to the dataframe
df = pd.concat([df, row], ignore_index=True)
print(df)

       Name   Age    City  Salary
0     Rahul  27.0   Tokyo    5000
1     Rohan  38.0   Paris    6000
2      Tiya  49.0  Mumbai    7000
3      Riya  71.0   Surat    9000
4     Diana  28.0    Bhuj    6000
5       Joy  16.0  Jaipur    8000
6   Nishant  54.0    Pune    4440
7     Heena  26.0    Pune    6398
8      Deep  60.0  Mumbai    1545
9    malhar  23.0   Tokyo    5000
10   malhar  21.0   Tokyo    5000
11     None   NaN   Tokyo    5000
12     None   NaN   Tokyo    5000
13     None   NaN   Tokyo    5000

In [17]:
# hanling missing data
df.isnull().sum()

Name      3
Age       3
City      0
Salary    0
dtype: int64

In [19]:
# delete row null value
df = df.dropna()
print(df)

       Name   Age    City  Salary
0     Rahul  27.0   Tokyo    5000
1     Rohan  38.0   Paris    6000
2      Tiya  49.0  Mumbai    7000
3      Riya  71.0   Surat    9000
4     Diana  28.0    Bhuj    6000
5       Joy  16.0  Jaipur    8000
6   Nishant  54.0    Pune    4440
7     Heena  26.0    Pune    6398
8      Deep  60.0  Mumbai    1545
9    malhar  23.0   Tokyo    5000
10   malhar  21.0   Tokyo    5000

In [20]:
# checking data gaya ya nahi
df.isnull().sum()

Name      0
Age       0
City      0
Salary    0
dtype: int64

In [56]:
new_row = {'Name':'Meet','Age': np.nan,'City':'Tokyo','Salary':np.nan}
row = pd.DataFrame([new_row])
#concat new row to the dataframe
df = pd.concat([df, row], ignore_index=True)
print(df)

      Name   Age    City  Salary
0    Rahul  27.0   Tokyo  5000.0
1    Rohan  38.0   Paris  6000.0
2     Tiya  49.0  Mumbai  7000.0
3     Riya  71.0   Surat  9000.0
4    Diana  28.0    Bhuj  6000.0
5      Joy  16.0  Jaipur  8000.0
6  Nishant  54.0    Pune  4440.0
7     Meet   NaN   Tokyo     NaN

In [57]:
df.isnull().sum()

Name      0
Age       1
City      0
Salary    1
dtype: int64

In [58]:
#adding values inplace of nan
df['Age'].fillna(df['Age'].mean())

0    27.000000
1    38.000000
2    49.000000
3    71.000000
4    28.000000
5    16.000000
6    54.000000
7    40.428571
Name: Age, dtype: float64

In [59]:
df['Salary'] = df['Salary'].fillna(1)

In [62]:
# add name column with Unknown where null
df['Name'] = df['Name'].fillna('Unknown')
print(df)

      Name   Age    City  Salary
0    Rahul  27.0   Tokyo  5000.0
1    Rohan  38.0   Paris  6000.0
2     Tiya  49.0  Mumbai  7000.0
3     Riya  71.0   Surat  9000.0
4    Diana  28.0    Bhuj  6000.0
5      Joy  16.0  Jaipur  8000.0
6  Nishant  54.0    Pune  4440.0
7     Meet   NaN   Tokyo     1.0

In [46]:
# removing dupilcates value
#drop_duplicates is a inbuilt fuction
df= df.drop_duplicates()
print(df)

       Name   Age    City  Salary
0     Rahul  27.0   Tokyo  5000.0
1     Rohan  38.0   Paris  6000.0
2      Tiya  49.0  Mumbai  7000.0
3      Riya  71.0   Surat  9000.0
4     Diana  28.0    Bhuj  6000.0
5       Joy  16.0  Jaipur  8000.0
6   Nishant  54.0    Pune  4440.0
7     Heena  26.0    Pune  6398.0
8      Deep  60.0  Mumbai  1545.0
9    malhar  23.0   Tokyo  5000.0
10   malhar  21.0   Tokyo  5000.0
11     Meet   NaN   Tokyo     1.0

In [64]:
#find the duplicates
duplicates = df.duplicated()
print(duplicates)
#find total duplicates 
total_duplicates = df.duplicated().sum()
print("Total duplicates ", total_duplicates)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool
Total duplicates  0

In [50]:
# it removes one duplicate
df = df.drop_duplicates(subset=['Name'])
print(df)

       Name   Age    City  Salary
0     Rahul  27.0   Tokyo  5000.0
1     Rohan  38.0   Paris  6000.0
2      Tiya  49.0  Mumbai  7000.0
3      Riya  71.0   Surat  9000.0
4     Diana  28.0    Bhuj  6000.0
5       Joy  16.0  Jaipur  8000.0
6   Nishant  54.0    Pune  4440.0
7     Heena  26.0    Pune  6398.0
8      Deep  60.0  Mumbai  1545.0
9    malhar  23.0   Tokyo  5000.0
11     Meet   NaN   Tokyo     1.0

In [51]:
# it removes  duplicate
df = df.drop_duplicates(subset=['City'])
print(df)

      Name   Age    City  Salary
0    Rahul  27.0   Tokyo  5000.0
1    Rohan  38.0   Paris  6000.0
2     Tiya  49.0  Mumbai  7000.0
3     Riya  71.0   Surat  9000.0
4    Diana  28.0    Bhuj  6000.0
5      Joy  16.0  Jaipur  8000.0
6  Nishant  54.0    Pune  4440.0

In [53]:
# reset index 
#if after removing duplicates if the index value chnges use this
df = df.drop_duplicates().reset_index(drop=True)
print(df)

      Name   Age    City  Salary
0    Rahul  27.0   Tokyo  5000.0
1    Rohan  38.0   Paris  6000.0
2     Tiya  49.0  Mumbai  7000.0
3     Riya  71.0   Surat  9000.0
4    Diana  28.0    Bhuj  6000.0
5      Joy  16.0  Jaipur  8000.0
6  Nishant  54.0    Pune  4440.0

In [65]:
#sort the data frame
#sort by age ascending
df = df.sort_values(by='Age')
print(df)

      Name   Age    City  Salary
5      Joy  16.0  Jaipur  8000.0
0    Rahul  27.0   Tokyo  5000.0
4    Diana  28.0    Bhuj  6000.0
1    Rohan  38.0   Paris  6000.0
2     Tiya  49.0  Mumbai  7000.0
6  Nishant  54.0    Pune  4440.0
3     Riya  71.0   Surat  9000.0
7     Meet   NaN   Tokyo     1.0

In [67]:
# delete row null value
df = df.dropna()
print(df)

      Name   Age    City  Salary
3     Riya  71.0   Surat  9000.0
6  Nishant  54.0    Pune  4440.0
2     Tiya  49.0  Mumbai  7000.0
1    Rohan  38.0   Paris  6000.0
4    Diana  28.0    Bhuj  6000.0
0    Rahul  27.0   Tokyo  5000.0
5      Joy  16.0  Jaipur  8000.0

In [68]:
# srot by descending
df = df.sort_values(by='Age', ascending = False)
print(df)

      Name   Age    City  Salary
3     Riya  71.0   Surat  9000.0
6  Nishant  54.0    Pune  4440.0
2     Tiya  49.0  Mumbai  7000.0
1    Rohan  38.0   Paris  6000.0
4    Diana  28.0    Bhuj  6000.0
0    Rahul  27.0   Tokyo  5000.0
5      Joy  16.0  Jaipur  8000.0

In [69]:
# sort multiple columns
df = df.sort_values(by=['City','Age'])
print(df)

      Name   Age    City  Salary
4    Diana  28.0    Bhuj  6000.0
5      Joy  16.0  Jaipur  8000.0
2     Tiya  49.0  Mumbai  7000.0
1    Rohan  38.0   Paris  6000.0
6  Nishant  54.0    Pune  4440.0
3     Riya  71.0   Surat  9000.0
0    Rahul  27.0   Tokyo  5000.0

In [82]:
# adding new rows 
new_row = {'Name':'malhar','Age': 22,'City':'Pune','Salary':5522}
row = pd.DataFrame([new_row])
#concat new row to the dataframe
df = pd.concat([df, row], ignore_index=True)
print(df)

       Name   Age    City  Salary
0     Diana  28.0    Bhuj  6000.0
1       Joy  16.0  Jaipur  8000.0
2      Tiya  49.0  Mumbai  7000.0
3     Rohan  38.0   Paris  6000.0
4   Nishant  54.0    Pune  4440.0
5      Riya  71.0   Surat  9000.0
6     Rahul  27.0   Tokyo  5000.0
7      Meet  22.0   Tokyo  5522.0
8       roy  22.0   Tokyo  5522.0
9       roy  22.0   Tokyo  5522.0
10      roy  22.0   Tokyo  5522.0
11      roy  22.0   Tokyo  5522.0
12      roy  22.0   Paris  5522.0
13     kila  22.0   Paris  5522.0
14     kila  22.0   Paris  5522.0
15   malhar  22.0   Paris  5522.0
16   malhar  22.0   Paris  5522.0
17   malhar  22.0    Pune  5522.0

In [78]:
# delete row null value
df = df.dropna()
print(df)

       Name   Age    City  Salary
0     Diana  28.0    Bhuj  6000.0
1       Joy  16.0  Jaipur  8000.0
2      Tiya  49.0  Mumbai  7000.0
3     Rohan  38.0   Paris  6000.0
4   Nishant  54.0    Pune  4440.0
5      Riya  71.0   Surat  9000.0
6     Rahul  27.0   Tokyo  5000.0
8      Meet  22.0   Tokyo  5522.0
9       roy  22.0   Tokyo  5522.0
10      roy  22.0   Tokyo  5522.0
11      roy  22.0   Tokyo  5522.0
12      roy  22.0   Tokyo  5522.0
13      roy  22.0   Paris  5522.0
14     kila  22.0   Paris  5522.0

In [83]:
df

       Name   Age    City  Salary
0     Diana  28.0    Bhuj  6000.0
1       Joy  16.0  Jaipur  8000.0
2      Tiya  49.0  Mumbai  7000.0
3     Rohan  38.0   Paris  6000.0
4   Nishant  54.0    Pune  4440.0
5      Riya  71.0   Surat  9000.0
6     Rahul  27.0   Tokyo  5000.0
7      Meet  22.0   Tokyo  5522.0
8       roy  22.0   Tokyo  5522.0
9       roy  22.0   Tokyo  5522.0
10      roy  22.0   Tokyo  5522.0
11      roy  22.0   Tokyo  5522.0
12      roy  22.0   Paris  5522.0
13     kila  22.0   Paris  5522.0
14     kila  22.0   Paris  5522.0
15   malhar  22.0   Paris  5522.0
16   malhar  22.0   Paris  5522.0
17   malhar  22.0    Pune  5522.0

In [84]:
# grouping data & aggeration
## group by city and count number of people in each city
# size function to count 
city_counts = df.groupby('City').size()
print(city_counts)

City
Bhuj      1
Jaipur    1
Mumbai    1
Paris     6
Pune      2
Surat     1
Tokyo     6
dtype: int64

In [85]:
# finding max and min salary in each city
age_stats = df.groupby('City')['Salary'].agg(['max','min'])
print(age_stats)

           max     min
City
Bhuj    6000.0  6000.0
Jaipur  8000.0  8000.0
Mumbai  7000.0  7000.0
Paris   6000.0  5522.0
Pune    5522.0  4440.0
Surat   9000.0  9000.0
Tokyo   5522.0  5000.0